## Pandas 1
##pip install pandas
##pip install jupyter

In [77]:
!ls

Martes29     Miercoles5-5  ingresos.xlsx	notebook.ipynb
Miercoles30  README.md	   netflix_titles.xlsx	tortuga

In [79]:
import pandas as pd

In [4]:
df = pd.Series([1,2,3])
df

0    1
1    2
2    3
dtype: int64

In [10]:
df2 = pd.Series([1,2,3,4,5], index = ["0","1","2","3","4"])
df2["1"]

2

In [17]:
df3 = pd.Series({"uno": 1, "dos": 2, "tres":3, "cuatro": 4})
type(df3["uno"])

pandas.core.series.Series

In [33]:
df4 = pd.DataFrame({
    "nombre":["Christian", "Jesus", "Galileo"],
    "edad":[1,24, 7],
    "color":["negro", "amarillo", ""]
})
df4.index
df4.columns

Index(['nombre', 'edad', 'color'], dtype='object')

In [35]:
l1 = [1,2,3,4,5,6]
l2 = [0,1,2,3,4,5]
df5 = pd.DataFrame(data= l1, index = l2)
df5

   0
0  1
1  2
2  3
3  4
4  5
5  6

In [38]:
l1 = {"nombre": [True, False], "color": [2,3] }
l2 = [0,1]
df6 = pd.DataFrame(data= l1, index = l2)
df6

   nombre  color
0    True      2
1   False      3

In [56]:
df7 = pd.DataFrame({
    "nombre":["Christian", "Jesus", "Galileo", "Alejandro", "Liliana", "Skiper"],
    "edad":[1,24, 7,45, 12, 45],
    "color":["negro", "amarillo", "verde", "negro", "violeta", "naranja"]
})
df7[df7["edad"]<18]
df7[df7["nombre"]=="Skiper"]
df_filtrado = df7[df7["color"]== "negro"]

In [57]:
df_ordenado= df7.sort_values("edad")

In [58]:
df_filtrado

      nombre  edad  color
0  Christian     1  negro
3  Alejandro    45  negro

In [59]:
df_ordenado

      nombre  edad     color
0  Christian     1     negro
2    Galileo     7     verde
4    Liliana    12   violeta
1      Jesus    24  amarillo
3  Alejandro    45     negro
5     Skiper    45   naranja

In [63]:
df_nuevo = df_ordenado["edad"]
df_nuevo.min()
df_nuevo.max()
df_nuevo.mean()

22.333333333333332

In [64]:
for i in df7:
    print(i)

nombre
edad
color

In [82]:
df8 = pd.read_csv("titanic3.csv")

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,0,"Zabour, Miss. Hileni",female,14.5000,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.5000,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3,0,"Zakarian, Mr. Ortin",male,27.0000,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3,0,"Zimmerman, Mr. Leo",male,29.0000,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN

In [ ]:
df8.columns